Revit 2026 API

# FamilyInstanceGetReferenceName Method

---

Gets the name of the reference plane in the family corresponding to the given family instance reference.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public string GetReferenceName(
	Reference reference
)
```
```vb
Public Function GetReferenceName (
	reference As Reference
) As String
```
```cpp
public:
String^ GetReferenceName(
	Reference^ reference
)
```
```fsharp
member GetReferenceName :
        reference : Reference -> string
```

#### Parameters

reference Reference
     The family instance reference.

#### Return Value

String Returns the name of the reference plane in the family corresponding to the given family instance reference. If the reference doesn't correspond to a named reference plane, returns an empty string.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

If the given family reference corresponds to a named reference plane in the instance's family, the name of that reference plane will be returned. Otherwise, an empty string will be returned.

#### Reference

FamilyInstance Class

Autodesk.Revit.DB Namespace